/**
	*(asterisk)를 2개 사용한 주석은
	*도큐먼터리 주석으로 문서의 정보를
	*나타낼 때 사용합니다.
	*작성자 : 남우경
	*작성일 : 8월 10일
 */

//한 줄 주석입니다.
//이것은 주석이 아니라서 예외(에러)를 발생시킵니다.
//주석은 컴파일할 때 삭제되어서 컴파일 됩니다.
//그래서 주석은 프로그램의 용량에 영향을 주지 않습니다.
/*한 번에 많은 주석을 넣을 때는 이 주석을 사용합니다.*/
/*
	여러 줄에
	 주석을 적으려면
	  이 주석을
	   사용합니다.
 */


package doitjava;

public class MyName {

	public static void main(String[] args) {
		// TODO 자동 생성된 메소드 스텁
		System.out.println("제 이름은 남우경입니다."); //화면출력 코드
		System.out.println("직업은 학생입니다."); //둘째 줄의 출력 코드
	}

	/*
	 * 첫 수업 시간에 작성한 코드입니다.
	 * 어떤 언어를 학습할 때 최초로 화면 출력을
	 * 배우게 됩니다.
	 * */
}
